In [1]:
# 데이터 불러오기 
# 데이터 프레임 : 데이터를 보기 쉽게 가져 올 수 있는 방식

In [2]:
# 행렬의 데이터를 처리하는데 필요한 기능들이 많이 있음 
# 데이터 처리에 편리함 
import pandas as pd

In [22]:
# 데이터를 읽어 들일 때는 read_excel() 함수 사용 
# read_ 로 시작되는 것 => 파일을 읽어오는 것 
# 읽어들인 데이터의 형태는 데이터 프레임 형태라고 칭한다
# 데이터 프레임 : 행과 열과  되어 있는 형태 
# 1번째 값 : 파일 위치, 파일 명 
# 2번째 header : 제목의 위치 header = 0 이면 생략 가능 
# 3번째 skipfooter : 제일 하단에 읽어들이지 않을 행을 지정 skipfooter = 0 이면 생략 가능 
# 4번쨰 usecols (사용자 데이터 변수) : 읽어들일 변수 (컬럼 == 제목)의 열을 지정, usecols 전체 가져 올거다 -> 생략 가능
# 기본적으로 0번째 시트를 불러옴 
# 가져 온 결과 : 데이터 프레임 형태 -> 바로 사용이 안됨 -> 사용을 하려면 저장 필요 
# 데이터 프레임 변수(sample_1)로 받아와야 한다 

sample_1 = pd.read_excel("./files_01/sample_1.xlsx", 
              header = 1,
              skipfooter = 2,
              usecols = "A:C")

In [23]:
sample_1

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [28]:
# 데이터 프레임의 정보 확인하기 : info() 함수
# 데이터 프레임 : 행과 열의 데이터 셋 
# <class 'pandas.core.frame.DataFrame'>  
# DataFrame : class 다  그 전의 내용은 경로 
# RangeIndex: 6 entries, 0 to 5 
# entries 전체 행의 개수 : 6 / 0to5 : 행의 인덱스 번호
# Data columns (total 3 columns) : 컬럼을 3개 가져옴 
# 각 컬럼의 인덱스 번호 :  #   Column
# 각 컬럼 별 로우의 개수 (null이 아닌 값만 카운트): Non-Null Count
# Dtype : data type 
# object : 문자열 ( 숫자가 아닌 문자를 모두 object)
# 데이터 처리 전에 꼭 info 해서 rangeindex 개수와 각 컬럼의 개수가 동일 한지 확인 해야 한다 
# -> 아닌 경우 : 결측치 존재 하는 것 

# <info> 에서 확인할 사항 
# RangeIndex(전체 행의 개수) 와 각 Column(컬럼)의 개수가 동일한지 확인 
#     (동일하지 않다면 Column에 누락된 값이 있을 수 있음 -> 결측치)
# Dtype(데이터타입) 확인하기 -> 의심되는 타입이 있으면 데이터 확인하기 

sample_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국적코드    6 non-null      object
 1   성별      6 non-null      object
 2   입국객수    6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [35]:
# 데이터 확인하기 
# 기본적으로 상위 5개의 데이터를 조회 시켜준다 
# head()에 값을 넣어주면 값만큼 조회시켜 준다 
sample_1.head(2)

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436

In [38]:
# 데이터 확인하기 
# 기본적으로 밑에서 있는 데이터 부터 5개 조회
# 값을 넣어주면 값만큼 조회시켜 준다
sample_1.tail()

  국적코드  성별    입국객수
1  A01  여성  191436
2  A31  남성     319
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [39]:
# 기초 통계값 확인하기 
# 카운트, 평균, 표준편차, 최소값, 최대 값, 4분위 값들 
# int float 타입의 데이터만 처리를 해준다 
# 해당 통계 값을 확인 해서 이상치가 있는 지 확인 해본다 

sample_1.describe()

                입국객수
count       6.000000
mean   114995.333333
std     98105.752006
min        42.000000
25%     26819.250000
50%    132616.000000
75%    183305.000000
max    232943.000000

# 컬럼 단위로 데이터 추출하기

In [47]:
# 리스트 하나에 대한 값이 나옴
sample_1["국적코드"]

0    A01
1    A01
2    A31
3    A31
4    A18
5    A18
Name: 국적코드, dtype: object

In [50]:
# 두개의 리스트를 가져와야 한다 -> 두개의 대괄호 (2차원)
sample_1[["국적코드", "성별"]]

  국적코드  성별
0  A01  남성
1  A01  여성
2  A31  남성
3  A31  여성
4  A18  남성
5  A18  여성

In [53]:
# 3차원 데이터 : 2차원 이상인 경우에는 그냥 , 로 구분해서 추출하면 된다 
sample_1[["국적코드", "성별", "입국객수"]]

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [63]:
# 데이터 프레임에 컬럼을 추가하는 방법 : 딕셔너리와 동일하다
# 컬럼 (데이터 변수) 추가하기 
sample_1["기준년월"] = "2019-11"

In [64]:
sample_1

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
2  A31  남성     319  2019-11
3  A31  여성      42  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [61]:
# 일괄처리
sample_1["기준년월"] = "2020-11"

In [62]:
sample_1

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2020-11
1  A01  여성  191436  2020-11
2  A31  남성     319  2020-11
3  A31  여성      42  2020-11
4  A18  남성  158912  2020-11
5  A18  여성  232943  2020-11

## 행단위로 컨트롤

In [84]:
sample_1

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
2  A31  남성     319  2019-11
3  A31  여성      42  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [66]:
# 특정 값이 있는 로우만 추출하기 (필터링하기) : 조건 처리와 동일 
# 있으면 true, 없으면 false => 조회의 개념이 아니라 구분의 개념 
sample_1["성별"] == "여성"

0    False
1     True
2    False
3     True
4    False
5     True
Name: 성별, dtype: bool

In [71]:
# 필터링한 결과에 대한 행만 추출하는 방법 
# 여성인 데이터만 가져오고 싶다 
condition = sample_1["성별"] == "여성" 
condition
sample_1[condition == True]

# 남성인 데이터 만 가져 오고 싶다 
condition = sample_1["성별"] == "여성" 
condition
sample_1[condition == False]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
2  A31  남성     319  2019-11
4  A18  남성  158912  2019-11

In [73]:
sample_1[(sample_1["성별"] == "여성") == True]

  국적코드  성별    입국객수     기준년월
1  A01  여성  191436  2019-11
3  A31  여성      42  2019-11
5  A18  여성  232943  2019-11

In [75]:
# 문제 
#  입국객수가 150,000 이상인 데이터만 조회하기 
sample_1[(sample_1["입국객수"] >= 150000) == True]

  국적코드  성별    입국객수     기준년월
1  A01  여성  191436  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [94]:
# 문제
# 성별이 남성이면서 입국객수가 150,000이상인 데이터만 조회
sample_1[(sample_1["성별"] == "남성") & (sample_1["입국객수"] >= 150000)]

  국적코드  성별    입국객수     기준년월
4  A18  남성  158912  2019-11

In [95]:
sample_1[(sample_1["성별"] == "남성") | (sample_1["입국객수"] >= 150000)]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
2  A31  남성     319  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [96]:
# 문제 
# 국적코드가 A01이거나 A18인 데이터만 조회해 주세요
sample_1[(sample_1["국적코드"] == "A01") | (sample_1["국적코드"] == "A18") |\
         (sample_1["국적코드"] == "A31")]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
2  A31  남성     319  2019-11
3  A31  여성      42  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [100]:
# isin : 데이터 각 로우에서 조건인 것이 있는지 확인 하고 있으면 True 
sample_1[sample_1["국적코드"].isin(["A01", "A18", "A31"])]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
2  A31  남성     319  2019-11
3  A31  여성      42  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

## 데이터 통합하기

In [101]:
# 데이터 통합하기 : 옆으로 통합, 밑으로 통합 2가지 방법 
sample_1

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
2  A31  남성     319  2019-11
3  A31  여성      42  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [103]:
# 국적 코드로 나라이름 데이터 가져오기 
## 코드 마스터 파일 읽어오기 
# 변수이름 : code_master
code_master = pd.read_excel("./files_01/sample_codemaster.xlsx")

In [104]:
code_master

  국적코드     국적명
0  A01      일본
1  A02      대만
2  A03      홍콩
3  A18      중국
4  A19      이란
5  A22  우즈베키스탄
6  A23   카자흐스탄
7  A99  아시아 기타

In [105]:
# 컬럼 단위로 통합하기 : merge() 함수 사용
# left : 통합할 기준 데이터 프레임 
# right : 가져올 데이터가 있는 데이터 프레임 
# how : 어떻게 가져올지 지정 (inner : 같은 것만, left : 왼쪽 전체, 없으면 없는 데로)
# left_ on : 왼쪽 데이터프레임에서 오른쪽 데이터 프레임과 비교할 컬럼 지정
# right_on : 오른쪽 데이터 프레임에서 왼쪽 데이터 프레임과 비교할 컬럼 지정 
# 같은 값이 있는 경우만 가져 온다 
pd.merge(left = sample_1,
        right=code_master,
        how = "inner",
        left_on = "국적코드",
        right_on = "국적코드")

  국적코드  성별    입국객수     기준년월 국적명
0  A01  남성  106320  2019-11  일본
1  A01  여성  191436  2019-11  일본
2  A18  남성  158912  2019-11  중국
3  A18  여성  232943  2019-11  중국

In [108]:
# 왼쪽 데이터는 일단 모두 가져옴 
# 가져 올 때 오른쪽과 같은 것이 있으면 같은거 가져오고 아니면 NaN 처리 
sample_1_code = pd.merge(left = sample_1,
                        right=code_master,
                        how = "left",
                        left_on = "국적코드",
                        right_on = "국적코드")
sample_1_code

  국적코드  성별    입국객수     기준년월  국적명
0  A01  남성  106320  2019-11   일본
1  A01  여성  191436  2019-11   일본
2  A31  남성     319  2019-11  NaN
3  A31  여성      42  2019-11  NaN
4  A18  남성  158912  2019-11   중국
5  A18  여성  232943  2019-11   중국

In [111]:
# 행단위로 데이터를 가져 오는 방법 (통합하느 방법) 
# 컬럼의 개수가 같아야지만 가능하다 

sample_2 = pd.read_excel("./files_01/sample_2.xlsx",
                        header = 1, 
                        skipfooter = 2,
                        usecols = "A:C")
sample_2

  국적코드  성별    입국객수
0  A01  남성   92556
1  A01  여성  163737
2  A18  남성  155540
3  A18  여성  249023

In [112]:
sample_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국적코드    4 non-null      object
 1   성별      4 non-null      object
 2   입국객수    4 non-null      int64
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [114]:
sample_2.describe()

                입국객수
count       4.000000
mean   165214.000000
std     64288.156633
min     92556.000000
25%    139794.000000
50%    159638.500000
75%    185058.500000
max    249023.000000

In [116]:
# [문제]
# sample_1의 최종 결과와 동일한 컬럼을 만들어주세요
# 기준년월은 2019-12 로 합니다 
sample_2["기준년월"] = "2019-12"
sample_2

  국적코드  성별    입국객수     기준년월
0  A01  남성   92556  2019-12
1  A01  여성  163737  2019-12
2  A18  남성  155540  2019-12
3  A18  여성  249023  2019-12

In [118]:
# sample_2_code 변수로 최종 국가이름까지 추가 
sample_2_code = pd.merge(left = sample_2,
                        right = code_master,
                        how = "left",
                        left_on = "국적코드",
                        right_on = "국적코드")
sample_2_code

  국적코드  성별    입국객수     기준년월 국적명
0  A01  남성   92556  2019-12  일본
1  A01  여성  163737  2019-12  일본
2  A18  남성  155540  2019-12  중국
3  A18  여성  249023  2019-12  중국

In [123]:
# 행단위 데이터 합치기 : concat() 함수 
# 합칠 인자가 리스트 형이다 -> 여러개를 입력 할 수 있다 
# 기본은 인덱스 번호를 그래도 유지
# ignore_index = True : 인덱스 순차적으로 증가되게 정렬

sample = pd.concat([sample_1_code, sample_2_code],ignore_index = True)
sample

  국적코드  성별    입국객수     기준년월  국적명
0  A01  남성  106320  2019-11   일본
1  A01  여성  191436  2019-11   일본
2  A31  남성     319  2019-11  NaN
3  A31  여성      42  2019-11  NaN
4  A18  남성  158912  2019-11   중국
5  A18  여성  232943  2019-11   중국
6  A01  남성   92556  2019-12   일본
7  A01  여성  163737  2019-12   일본
8  A18  남성  155540  2019-12   중국
9  A18  여성  249023  2019-12   중국

## 데이터 파일로 저장하기

In [125]:
# 파일명은 데이터 프레임 명과 동일하게 하는 것이 좋다 
# 작업 폴더에 files_01_new 폴더 생성 
sample.to_excel("./files_01_new/sample.xlsx")
# 저장 후에 꼭 파일 생성 제대로 됐는지 확인하기

In [135]:
# 엑셀 파일로 저장할 경우 인덱스도 같이 저장된다 
# 인덱스 번호가 추가되지 않도록 하려면 index 속성값 False 로 지정 
# 엑셀 파일로 지정할 경우에만 사용 
# index = False : 인덱스 없이 저장하기 

sample.to_excel("./files_01_new/sample.xlsx", index = False)

In [170]:
start = 0
end = 1
yy = 2019
mm = start + 1
sample = pd.read_excel("./files_01_all/sample({}).xlsx".format(start),
                  header = 1,
                  skipfooter = 2,
                  usecols = "A:C")
sample["지정년월"] = "{}-{}".format(yy,str(mm).zfill(2))
sample_code = pd.merge(left = sample,
                      right = code_master,
                      how = "left",
                      left_on = "국적코드",
                      right_on = "국적코드")
sample_all = sample_code

for i in range(1,end + 1,1) :
    mm = i + 1
    
    if (start + 1) % 12 == start :
        mm = 1
        yy += (start + 1) // 12

    sample = pd.read_excel("./files_01_all/sample({}).xlsx".format(i),
                      header = 1,
                      skipfooter = 2,
                      usecols = "A:C")
    sample["지정년월"] = "{}-{}".format(yy,str(mm).zfill(2))
    sample_code = pd.merge(left = sample,
                          right = code_master,
                          how = "left",
                          left_on = "국적코드",
                          right_on = "국적코드")
    sample_all = pd.concat([sample_all, sample_code],ignore_index = True)

sample_all

  국적코드  성별    입국객수     지정년월  국적명
0  A01  남성  106320  2019-01   일본
1  A01  여성  191436  2019-01   일본
2  A31  남성     319  2019-01  NaN
3  A31  여성      42  2019-01  NaN
4  A18  남성  158912  2019-01   중국
5  A18  여성  232943  2019-01   중국

In [218]:
# 작업 폴더에 files_01_all 폴더 생성 
# files_01 내의 sample_1.xlsx 파일 복사해서 files_01_all에 붙여넣기 
# sample.xlsx 으로 이름 변경 후 파일 30~ 40 개 정도 복붙 
# 모두선택 -> 이름 바꾸기 sample(0) 입력 -> 전체 변경 됨 

# files_all의 모든 데이터 통합하기
# 기준년도 : 2019-01부터 시작 
# 최종 결과 변수명 : sample_all
# 최종 결과 파일명 : sample_all.xlsx
# 파일저장 위치 : files_01_new 
# 함수 만들어서 처리하기 

def MerCon (start, end) :
    yy = 2019
    mm = 1
        
    sample = pd.read_excel("./files_01_all/sample({}).xlsx".format(start),
                      header = 1,
                      skipfooter = 2,
                      usecols = "A:C")
    sample["지정년월"] = "{}-{}".format(yy,str(mm).zfill(2))
    sample_code = pd.merge(left = sample,
                          right = code_master,
                          how = "left",
                          left_on = "국적코드",
                          right_on = "국적코드")
    sample_all = sample_code

    for i in range(start + 1 ,end + 1,1) :
        mm += 1
        if (i) % 12 == start :
            mm = 1
            yy += 1
            

        sample = pd.read_excel("./files_01_all/sample({}).xlsx".format(i),
                          header = 1,
                          skipfooter = 2,
                          usecols = "A:C")
        sample["지정년월"] = "{}-{}".format(yy,str(mm).zfill(2))
        sample_code = pd.merge(left = sample,
                              right = code_master,
                              how = "left",
                              left_on = "국적코드",
                              right_on = "국적코드")
        sample_all = pd.concat([sample_all, sample_code],ignore_index = True)

    sample_all.to_excel("./files_01_new/sample_all.xlsx", index = False)    
    
    return sample_all

In [220]:
sample_all = MerCon(0,30)
sample_all

    국적코드  성별    입국객수     지정년월  국적명
0    A01  남성  106320  2019-01   일본
1    A01  여성  191436  2019-01   일본
2    A31  남성     319  2019-01  NaN
3    A31  여성      42  2019-01  NaN
4    A18  남성  158912  2019-01   중국
..   ...  ..     ...      ...  ...
181  A01  여성  191436  2021-07   일본
182  A31  남성     319  2021-07  NaN
183  A31  여성      42  2021-07  NaN
184  A18  남성  158912  2021-07   중국
185  A18  여성  232943  2021-07   중국

[186 rows x 5 columns]

In [ ]:
# 깨끗한 데이터 프레임 만들기 
sample_all = pd.DataFrame()

# try : ~ except: ~ 
# 오류가 아니라 예외 발생시 처리 해주는 것